// --створити масив з:
//     - з 5 числових значень
// - з 5 стічкових значень
// - з 5 значень стрічкового, числового та булевого типу
// - та вивести його в консоль


// let array1 = [
//     [1, 2, 3, 4, 5],
//     ["1", "2", "3", "4", "5"],
//     ["1", "2", 3, 4, true]
// ];
//
// console.log(array1);


//
// -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль

    // let array1 = [];
    // array1[0] = "Malvinity";
    // array1[1] = "Pushunka";
    // array1[2] = 2424;
    // array1[3] = false;
    // array1[4] = Math.PI;
    // console.log(array1);


//
//
//
//
// - є масив [2,17,13,6,22,31,45,66,100,-18] :

// let array1 = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
//
// // 1. перебрати його циклом while
//
// let i = 0;
// while (i < array1.length) {
//     console.log(array1[i]);
//     i++;
// }


//     2. перебрати його циклом for

// for (let i = 0; i < array1.length; i++) {
//     console.log(array1[i]);
// }

//     3. перебрати циклом while та вивести  числа тільки з непарним індексом

// let i = 0;
// while (i < array1.length) {
//     if (i % 2) {
//         console.log(array1[i]);
//     }
//     i++;
// }






// 4. перебрати циклом for та вивести  числа тільки з непарним індексом

// for (let i = 0; i < array1.length; i++) {
//     if (i % 2) {
//         console.log(array1[i]);
//     }
// }


// 5. перебрати циклом while та вивести  числа тільки парні  значення

// let i = 0;
// while (i < array1.length) {
//     if (i % 2 === 0) {
//         console.log(array1[i]);
//     }
//     i++;
// }


// 6. перебрати циклом for та вивести  числа тільки парні  значення

// for (let i = 0; i < array1.length; i++) {
//     if (i % 2 === 0) {
//         console.log(array1[i]);
//     }
// }


// 7. замінити кожне число кратне 3 на слово "okten"
//
// for (let i in array1) {
//     let value = array1[i];
//     if (value % 3 === 0) {
//         array1[i] = "Okten";
//     }
//
//
// }
// console.log(array1);

// 8. вивести масив в зворотньому порядку.

// for (let i = array1.length - 1; i >= 0; i--) {
//     let arr = array1[i];
//     console.log(arr);
// }

// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
//

// let i = array1.length - 1;
// while (i >= 0) {
// let arr = array1[i];
//     console.log(arr);
//     i--;
// }


// for (let i = array1.length - 1; i >= 0; i--) {
//     let arr = array1[i];
//     console.log(arr);
// }


// let i = array1.length - 1;
// while (i >= 0) {
//     let arr = array1[i];
//     if (i % 2 === 0) {
//         console.log(arr);
//     }
//     i--;
// }


// for (let i = array1.length - 1; i >= 0; i--) {
//     let arr = array1[i];
//     if (i % 2 === 0) {
//         console.log(arr);
//     }
// }


// let i = array1.length - 1;
// while (i >= 0) {
//     let arr = array1[i];
//     if (i % 2) {
//         console.log(arr);
//     }
//     i--;
// }


// for (let i = array1.length - 1; i >= 0; i--) {
//     let arr = array1[i];
//     if (i % 2) {
//         console.log(arr);
//     }
// }







// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.

// let array = [1, 2, 4, 6, 23, 1, 56, 7, 25, 356];
//
// for (let i = 0; i < array.length; i++) {
//     console.log(array[i]);
// }

// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.

// let array = ["JS", "JS", "JS", "JS", "JS", "JS", "JS", "JS", "JS", "JS",];
//
// for (let i = 0; i < array.length; i++) {
//     console.log(array[i]);
// }

// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.

// let array = ["JS", "JS", "JS", "JS", false, 1, 56, 7, 25, 356];
//
// for (let i = 0; i < array.length; i++) {
//     console.log(array[i]);
// }

// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи

let array = ["JS", true, "JS", "JS", false, 1, 56, 7, 25, 356];



// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи
//
// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.
// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write
//
//
//
// стоврити масив книжок (назва, кількість сторінок, автори , жанри).
// -знайти наібльшу книжку.
// - знайти книжку/ки з найбільшою кількістю жанрів
// - знайти книжку/ки з найдовшою назвою
// - знайти книжку/ки які писали 2 автори
// - знайти книжку/ки які писав 1 автор